other-codes/openfoam-toolchain-with-gmsh-main/Simulation_Outputs/test_1/simpleFoam/4_freestream_kwSST_cp/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type surfaces;
libs            ("libsampling.so");

interpolationScheme cellPoint;

surfaceFormat       raw;

surfaces
(
    main
    {
        type      patch;
        patches   (_VARnameSTLwithoutExtension___VARnameSTLwithoutExtension_);
        triangulate	false;
    }
    
    flap
    {
        type      patch;
        patches   (_VARnameSTLwithoutExtension___VARnameSTLwithoutExtension_FLAP);
        triangulate	false;
    }
    
);

fields          (p);

// ************************************************************************* //
